<?php

// +----------------------------------------------------------------------
// |  系统配置
// +----------------------------------------------------------------------

use think\helper\Str;

return [

    // +-----------------------------------------------------
    // | 独立版配置 【脱离微擎时打开注释】
    // +-----------------------------------------------------

    [
        'type'  => 'mini_program',
        'key'   => 'appid',
        'value' => '',
        'note'  => '小程序appid【独立版】',
    ],
    [
        'type'  => 'mini_program',
        'key'   => 'secret',
        'value' => '',
        'note'  => '小程序开发者密钥【独立版】',
    ],

    // +-----------------------------------------------------
    // | 微信商户号
    // +-----------------------------------------------------

    [
        'type'  => 'merchant',
        'key'   => 'mch_id',
        'value' => '',
        'note'  => '微信商户号ID',
    ],
    [
        'type'  => 'merchant',
        'key'   => 'mch_key',
        'value' => '',
        'note'  => '微信商户号API密钥',
    ],
    [
        'type'  => 'merchant',
        'key'   => 'cert_path',
        'value' => '',
        'note'  => '微信商户号支付证书',
    ],
    [
        'type'  => 'merchant',
        'key'   => 'key_path',
        'value' => '',
        'note'  => '微信商户号支付证书',
    ],

    // +-----------------------------------------------------
    // | 消息推送
    // +-----------------------------------------------------

    [
        'type'  => 'message',
        'key'   => 'msg_token',
        'value' => Str::random(25),
        'note'  => '消息推送Token令牌',
    ],

    // +-----------------------------------------------------
    // | 客服消息
    // +-----------------------------------------------------

    [
        'type'  => 'service_message',
        'key'   => 'card_title',
        'value' => '识别下方二维码添加客服微信',
        'note'  => '客服消息消息卡片标题',
    ],
    [
        'type'  => 'service_message',
        'key'   => 'card_img',
        'value' => 'service_message/card_img.png',
        'note'  => '客服消息消息卡片图片',
        'image' => 1,
    ],
    [
        'type'  => 'service_message',
        'key'   => 'reply_img',
        'value' => 'service_message/reply_img.jpg',
        'note'  => '客服消息自动回复图片',
        'image' => 2,
    ],

    // +-----------------------------------------------------
    // | 订阅消息模板ID
    // +-----------------------------------------------------

    [
        'type'  => 'template_id',
        'key'   => 'test',
        'value' => 'Bi4ua3xcu68pdSQuhRoFVJnD-fAJ1OHcfsNHoJwOWbo',
        'note'  => '用于测试的订阅消息模板ID',
    ],
];
