<?php

// +----------------------------------------------------------------------
// |  系统配置
// +----------------------------------------------------------------------

use think\helper\Str;
use app\common\lib\easywechat\MiniProgram;

return [

    // +-----------------------------------------------------
    // | 客服消息
    // +-----------------------------------------------------

    [
        'type'  => 'message',
        'key'   => 'msg_token',
        'value' => Str::random(20),
    ],
    [
        'type'  => 'message',
        'key'   => 'msg_url',
        'value' => MiniProgram::replyApi(),
    ],
];
